#### RebarReinforcementData Members

---

|  |
| --- |
| RebarReinforcementData Class   Methods   Properties   See Also |

The  RebarReinforcementData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | Create | Creates a new instance of RebarReinforcementData, or    a null reference (  Nothing  in Visual Basic)  if the operation fails. |
| Public method | Dispose | (Inherited from  ReinforcementData  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | End | The end of the rebar. The end should be 0 or 1. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ReinforcementData  .) |
| Public property | RebarId | The id of the Rebar |

# See Also

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace